; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph4 - mode
	infrared5 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	infrared3 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(have_image Planet10 infrared5)
	(have_image Phenomenon11 infrared3)
	(have_image Phenomenon11 spectrograph2)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 infrared3)
	(have_image Planet13 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (calibrate satellite0 instrument0 groundstation9)
   added: (calibrated instrument0)
   goals met: 0 of 8
3. (turn_to satellite0 phenomenon11 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 8
4. (take_image satellite0 phenomenon11 instrument0 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 2 of 8
5. (take_image satellite0 phenomenon11 instrument0 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 3 of 8
6. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 8
7. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 3 of 8
8. (take_image satellite0 phenomenon12 instrument0 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 4 of 8
9. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 8
10. (turn_to satellite0 planet10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet10)
   goals met: 4 of 8
11. (take_image satellite0 planet10 instrument0 infrared5)
   added: (have_image planet10 infrared5)
   goals met: 5 of 8
12. (turn_to satellite0 phenomenon11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 8
13. (turn_to satellite0 planet13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet13)
   goals met: 5 of 8
14. (take_image satellite0 planet13 instrument0 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 6 of 8
15. (take_image satellite0 planet13 instrument0 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 7 of 8
16. (turn_to satellite0 phenomenon11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon11)
   goals met: 8 of 8
